yamaxgucci/esp32-os/sdkconfig.defaults.esp32s3
# ArgonOS - ESP32-S3 defaults (primary target).
#
# These assume an N16R8 style module: 16 MB flash, 8 MB octal PSRAM.
# Boards with quad PSRAM need CONFIG_SPIRAM_MODE_QUAD instead; that lives in
# the board pack, not here.

CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# PSRAM stays out of the general malloc pool: ArgonOS hands it out through
# per-process arenas and the executable app-text arena.
CONFIG_SPIRAM_USE_CAPS_ALLOC=y

# Deliberately NOT enabled: these copy the kernel's own code and constants into
# PSRAM at boot, which costs boot time and PSRAM and buys nothing here - both
# flash and PSRAM are reached through the same cache.  They are also unrelated
# to the application loader, which maps PSRAM into the instruction bus itself.
# CONFIG_SPIRAM_FETCH_INSTRUCTIONS
# CONFIG_SPIRAM_RODATA

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# 32 KB of instruction cache instead of the default 16.  Interpreters - the
# emulators' inner loops above all - do not fit in 16 KB and thrash it, and any
# .AXE larger than the code arena executes from flash through this cache.  The
# 16 KB comes out of internal SRAM, which is the price.
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y

# 192 KB of executable arena, the Kconfig maximum.  The Mega Drive image is
# 129 KB of code and the sound block is still to come, so the alternative would
# be flash XIP for the whole emulator plus a `hot_text` split to pull the inner
# loops back into SRAM - a format change to buy what this line buys outright.
# The cost is real and permanent: the arena is reserved at link time whether an
# app is running or not, so this is 128 KB the internal heap never sees.
CONFIG_ARGON_APP_ARENA_KB=192

# UART0 is the one console every board and QEMU agree on, and the ROM
# bootloader already talks there, so early output is not split across two
# devices.  USB-serial-JTAG becomes an additional console endpoint at runtime
# once the console multiplexer exists.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
